[
  {
    "dates": "Jun 2022 · Present",
    "role": "Full Stack Developer",
    "company": "Surya Digital Technology",
    "description": "At Surya Digital Technology, I was selected and placed as a full stack developer for various client projects, where I delivered high-quality web solutions and collaborated with diverse teams. I worked on a wide range of web applications, utilizing technologies such as Next.js, tRPC, Node.js, Sails.js, Gatsby.js, Astro.js, Laravel (PHP), and Odoo (Python). My role required me to quickly adapt to different client requirements and project scopes, demonstrating flexibility and strong problem-solving skills. By providing technical expertise in web development, UI/UX improvements, and feature implementation, I contributed to the success of multiple client businesses. This experience also allowed me to thrive in a dynamic recruitment and talent placement environment, supporting the company’s mission to connect top talent with business needs.",
    "url": "https://suryadt.co.id"
  },
  {
    "dates": "Jun 2022 · Present",
    "role": "Full Stack Developer (via Surya Digital Technology)",
    "company": "Upscalix",
    "description": "While working at Upscalix (via Surya Digital Technology), I developed and improved web applications using Next.js, PostgreSQL, Odoo (Python), Bootstrap, and jQuery to create strong admin and e-commerce solutions. I helped make the NextJS Admin Panel more user-friendly and efficient by adding features like payment configuration, customer management, and data export. I also fixed important issues in an Odoo-based e-commerce platform, such as problems with checkout, order processing, and search and filter functions, which made the platform more stable and easier to use. I improved the look and feel of several pages by following Figma designs and making sure they worked well on all devices. I also built a custom Odoo plugin for bulk order processing to meet special business needs. Throughout these projects, I worked closely with different teams to deliver quality solutions on time.",
    "url": "https://upscalix.com.au"
  },
  {
    "dates": "Jun 2022 · Present",
    "role": "Outsourced Full Stack Dev (via Surya Digital Technology)",
    "company": "VA For Everyone",
    "description": "As an outsourced fullstack developer for VA For Everyone, I built and improved business tools for Australian clients, such as CRM systems, dashboards, and landing pages, using technologies like Next.js, tRPC, Sails.js, React, Node.js, and AWS. I made dashboards and API calls faster, cutting load times for important financial reports by more than half. I added AI features, like automated email replies and scheduling assistants, using the OpenAI SDK to make tasks easier for users. I made sure data was reliable by stopping duplicate entries and fixing problems in form processing. I also turned old and WordPress-based landing pages into modern ones with Gatsby JS and Astro JS, following Figma designs for a better user experience. I quickly adjusted to changing project needs and worked with international teams to deliver solutions that fit each client's business.",
    "url": "https://vaforeveryone.com.au"
  },
  {
    "dates": "Dec 2019 · Apr 2022",
    "role": "Full Stack Developer",
    "company": "PT. Omni Hotelier International",
    "description": "Developed and maintained the online booking engine system using Laravel PHP Framework. Focused on refactoring and optimizing back-end queries to improve system performance and efficiency.",
    "url": "https://omnihotelier.com/en/home"
  },
  {
    "dates": "Jan 2018 · Nov 2019",
    "role": "Full Stack Developer",
    "company": "Bisloka",
    "description": "Responsible for completing the MVP version of the web app for bus and ELF rentals in Bali. Developed the application using Laravel PHP Framework, implementing features such as price comparison, payment methods, and customer support functionalities.",
    "url": "https://www.instagram.com/bisloka/"
  },
  {
    "dates": "Jul 2016 · Nov 2016",
    "role": "Internship",
    "company": "Avatar Solutions",
    "description": "Participated in an internship program, focusing on the development of .NET Desktop Applications. Gained hands-on experience in software development processes and IT solutions for various industries.",
    "url": "https://www.avatarsolution.com/"
  }
]
